Bwooce/ardupilot/libraries/AP_HAL_ESP32/Scheduler.cpp
    // Re-apply ESP-IDF log levels after parameter loading in setup()
    ESP32::esp32_params()->update_log_levels();

    // Re-enable task_wdt logging to catch real issues
    esp_log_level_set("task_wdt", ESP_LOG_WARN);

    sched->set_system_initialized();

#ifdef SCHEDDEBUG
    printf("%s:%d initialised\n", __PRETTY_FUNCTION__, __LINE__);
#endif
    static uint32_t max_loop_time = 0;  // Track max loop time across all iterations
    
    while (true) {
        // Reset WDT BEFORE running the loop to ensure we don't timeout
        static uint32_t wdt_reset_count = 0;
        static uint32_t last_wdt_reset_report = 0;
        esp_err_t wdt_err = esp_task_wdt_reset();
        if (wdt_err != ESP_OK) {
            GCS_SEND_TEXT(MAV_SEVERITY_CRITICAL, "WDT: Reset failed err=%d at %lu ms", 
                         (int)wdt_err, (unsigned long)AP_HAL::millis());
            ESP_LOGE("WDT", "Failed to reset WDT: error %d", wdt_err);
        } else {
            wdt_reset_count++;
            // Report WDT reset success periodically
            uint32_t now = AP_HAL::millis();
            if (now - last_wdt_reset_report > 10000) {
                last_wdt_reset_report = now;
                // Suppress this message - it's just counting successful WDT feeds, not actual resets
                // GCS_SEND_TEXT(MAV_SEVERITY_INFO, "WDT: %lu resets OK", 
                //              (unsigned long)wdt_reset_count);
                wdt_reset_count = 0;
            }
        }
        
        // Track loop timing for debugging
        static uint32_t last_loop_start = 0;
        uint32_t loop_start = AP_HAL::millis();
        uint32_t time_since_last = loop_start - last_loop_start;
        
        // Warn if too much time passed since last loop (indicates blocking)
        if (last_loop_start != 0 && time_since_last > 2000) {
            GCS_SEND_TEXT(MAV_SEVERITY_CRITICAL, "WDT: %lums since last loop!", 
                         (unsigned long)time_since_last);
        }
        last_loop_start = loop_start;
        
        sched->callbacks->loop();
        
        uint32_t loop_time = AP_HAL::millis() - loop_start;
        if (loop_time > max_loop_time) {
            max_loop_time = loop_time;
            if (loop_time > 2000) {  // Warn if loop takes > 2 seconds
                GCS_SEND_TEXT(MAV_SEVERITY_CRITICAL, "WDT: Loop took %lums (max %lums)", 
                             (unsigned long)loop_time, (unsigned long)max_loop_time);
            }
        }
        
        sched->delay_microseconds(250);

        // run stats periodically
#ifdef SCHEDDEBUG
        sched->print_stats();
        sched->print_esp32_cpu_stats();
#endif
        sched->print_main_loop_rate();
        
        // Delayed WDT info report (10 seconds after boot, once only)
        static bool wdt_delayed_report_done = false;
        static uint32_t boot_time = AP_HAL::millis();
        static uint32_t loop_count = 0;
        loop_count++;
        
        // Stagger this to 15 seconds to avoid collision with other periodic messages
        if (!wdt_delayed_report_done && AP_HAL::millis() - boot_time > 15000) {
            wdt_delayed_report_done = true;
            
            // Reset WDT before multiple GCS sends
            esp_task_wdt_reset();
            
            // Combine messages to reduce mLRS traffic
            if (wdt_info.magic == WDT_INFO_MAGIC) {
                // Send one combined message instead of multiple
                GCS_SEND_TEXT(MAV_SEVERITY_INFO, "WDT: %s S=%lu H=%lu L=%d", 
                             wdt_info.task_name,
                             (unsigned long)wdt_info.stack_hwm,
                             (unsigned long)wdt_info.heap_free,
                             (int)ESP32::esp32_params()->log_to_mavlink.get());
                esp_task_wdt_reset();
                // Don't clear magic here - let report_reset_reason do it
            }
        }
        
        // Save task info to RTC memory periodically (every ~5 seconds)
        // This will be available after a WDT reset
        static uint32_t last_wdt_save = 0;
        uint32_t now = AP_HAL::millis();
        if (now - last_wdt_save > 5000) {
            last_wdt_save = now;
            
            // Save current task info
            wdt_info.magic = WDT_INFO_MAGIC;
            
            // Get current task name
            const char* task_name = pcTaskGetName(NULL);
            if (task_name) {
                strncpy(wdt_info.task_name, task_name, sizeof(wdt_info.task_name)-1);
                wdt_info.task_name[sizeof(wdt_info.task_name)-1] = '\0';
            } else {
                strcpy(wdt_info.task_name, "main");
            }
            
            // Get stack high water mark (bytes remaining)
            wdt_info.stack_hwm = uxTaskGetStackHighWaterMark(NULL) * sizeof(StackType_t);
            
            // Save timestamp
            wdt_info.timestamp = xTaskGetTickCount();
            
            // Save heap info
            wdt_info.heap_free = esp_get_free_heap_size();
            wdt_info.heap_min = esp_get_minimum_free_heap_size();
            
            // Save last PC (instruction pointer) - approximate location
            // Note: This is a rough approximation, actual PC at WDT would be different
            wdt_info.last_pc = (uint32_t)__builtin_return_address(0);
            
            // Send periodic confirmation (every 30 seconds) - disabled for production
#if 0  // Enable for debugging stack/heap issues
            static uint32_t last_wdt_report = 0;
            if (now - last_wdt_report > 30000) {
                last_wdt_report = now;

                // Reset WDT before potentially blocking GCS send
                esp_task_wdt_reset();

                GCS_SEND_TEXT(MAV_SEVERITY_INFO, "WDT: Saved %s S=%lu H=%lu/%lu MaxLoop=%lu",
                             wdt_info.task_name,
                             (unsigned long)wdt_info.stack_hwm,
                             (unsigned long)wdt_info.heap_free,
                             (unsigned long)wdt_info.heap_min,
                             (unsigned long)max_loop_time);

                // Reset WDT after GCS send
                esp_task_wdt_reset();
            }
#endif
        };
    }
}

